test_examples/wireDrawing_OpenFoam_abaqus6/setup_openfoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleDyMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.0001;

deltaT          1e-10;

writeControl    timeStep;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   9;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.2;

functions
{
  Co1
{
    // Mandatory entries (unmodifiable)
    type                CourantNo;
        libs                ("libfieldFunctionObjects.so");
        executeControl      timeStep;
        executeInterval     2;
        writeControl        writeTime;
}

PRESSURE_upWire
    {
        type            surfaceRegion;
        libs            ( "libfieldFunctionObjects.so" );
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        timeFormat      fixed;
        timePrecision   5;
        operation       none;
        writeFields     true;
        surfaceFormat   raw;
        regionType      patch;
        name            upWire;
        fields          ( p );
    }

PRESSURE_deformWireWire
    {
        type            surfaceRegion;
        libs            ( "libfieldFunctionObjects.so" );
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        timeFormat      fixed;
        timePrecision   5;
        operation       none;
        writeFields     true;
        surfaceFormat   raw;
        regionType      patch;
        name            deformWire;
        fields          ( p );
    }
PRESSURE_finalWire
    {
        type            surfaceRegion;
        libs            ( "libfieldFunctionObjects.so" );
        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        timeFormat      fixed;
        timePrecision   5;
        operation       none;
        writeFields     true;
        surfaceFormat   raw;
        regionType      patch;
        name            finalWire;
        fields          ( p );
    }

}

// ************************************************************************* //
