test_examples/wireDrawing_OpenFoam_abaqus6/setup_openfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
 (-3.                    0.6453851511418801   -0.028178124238007057 )//0
 (-1.946275942148277     0.6453851511418801   -0.028178124238007057)//1
 ( 0.                    0.6453851511418801   -0.028178124238007057)//2
 ( 0.5                   0.6453851511418801   -0.028178124238007057)//3

 (-3.                    0.8117008968595947   -0.0354396265165748    )//4
 (-1.946275942148277     0.7546875575668726   -0.03295037036469163  )//5
 ( 0.005                 0.6493813440282076   -0.0283526017874684)//6
 ( 0.5                   0.6493813440282076   -0.0283526017874684)//7

 (-3.                    0.6453851511418801   0.028178124238007057)//8
 (-1.946275942148277     0.6453851511418801   0.028178124238007057 )//9
 ( 0.                    0.6453851511418801   0.028178124238007057)//10
 ( 0.5                   0.6453851511418801   0.028178124238007057)//11

 (-3.                    0.8117008968595947   0.0354396265165748   )//12
 (-1.946275942148277     0.7546875575668726   0.03295037036469163)//13
 ( 0.005               	 0.6493813440282076   0.0283526017874684)//14
 ( 0.5                   0.6493813440282076   0.0283526017874684)//15

 

);

blocks
(
    hex (0 1 5 4 8 9 13 12) (30 1 1) simpleGrading (1 1 1)//0
    hex (1 2 6 5 9 10 14 13) (60 1 1) simpleGrading (1 1 1)//1
    hex (2 3 7 6 10 11 15 14) (15 1 1) simpleGrading (1 1 1)//1
);

edges
(
);

boundary
(
    dieWall
    {
        type wall;
        faces
        (
            (5 4 12 13)
            (5 6 14 13)
            (6 14 15 7)
            
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (3 7 15 11)
            
        );
    }

    upWire
    {
        type wall;
        faces
        (
            (0 1 9 8)
	);
    }

    deformWire
    {
        type wall;
        faces
        (
            (1 2 10 9)    
        );
    }

   finalWire
    {
        type wall;
        faces
        (  
           (2 3 11 10)   
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 8 12 4)
            
        );
    }
   
    back
    {
        type wedge;
        faces
        (
            (0 4 5 1)
            (5 6 2 1)
            (6 7 3 2)
           
        );
    }
    front
    {
        type wedge;
        faces
        (
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
          
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
