test_examples/wireDrawing_OpenFoam_abaqus6/setup_openfoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    dieWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    


    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    inlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    
    upWire
    {
     	type            movingWallVelocity;
        value           uniform (7.5 0 0);
     }

    deformWire
    {
     	type            movingWallVelocity;
        value 		nonuniform List<vector>
      60
	(

	(	9.98073358	-0.523068083	0	)
	(	9.928706847	-0.520341477	0	)
	(	9.877085858	-0.517636136	0	)
	(	9.825866403	-0.514951838	0	)
	(	9.77504433	-0.512288366	0	)
	(	9.724615538	-0.509645505	0	)
	(	9.67457598	-0.507023043	0	)
	(	9.624921661	-0.50442077	0	)
	(	9.575648635	-0.50183848	0	)
	(	9.52675301	-0.499275969	0	)
	(	9.47823094	-0.496733035	0	)
	(	9.430078631	-0.49420948	0	)
	(	9.382292334	-0.491705106	0	)
	(	9.33486835	-0.48921972	0	)
	(	9.287803025	-0.486753131	0	)
	(	9.241092752	-0.484305149	0	)
	(	9.194733968	-0.481875588	0	)
	(	9.148723156	-0.479464264	0	)
	(	9.103056841	-0.477070994	0	)
	(	9.057731594	-0.474695598	0	)
	(	9.012744025	-0.4723379	0	)
	(	8.96809079	-0.469997723	0	)
	(	8.923768584	-0.467674894	0	)
	(	8.879774142	-0.465369243	0	)
	(	8.83610424	-0.463080601	0	)
	(	8.792755695	-0.4608088	0	)
	(	8.749725361	-0.458553676	0	)
	(	8.707010132	-0.456315065	0	)
	(	8.664606937	-0.454092808	0	)
	(	8.622512745	-0.451886745	0	)
	(	8.580724561	-0.449696719	0	)
	(	8.539239427	-0.447522575	0	)
	(	8.498054419	-0.44536416	0	)
	(	8.457166648	-0.443221323	0	)
	(	8.416573262	-0.441093914	0	)
	(	8.376271441	-0.438981785	0	)
	(	8.336258399	-0.43688479	0	)
	(	8.296531385	-0.434802786	0	)
	(	8.257087679	-0.432735629	0	)
	(	8.217924592	-0.430683178	0	)
	(	8.17903947	-0.428645295	0	)
	(	8.140429688	-0.426621842	0	)
	(	8.102092653	-0.424612684	0	)
	(	8.064025802	-0.422617684	0	)
	(	8.026226602	-0.420636712	0	)
	(	7.988692549	-0.418669636	0	)
	(	7.95142117	-0.416716326	0	)
	(	7.914410019	-0.414776653	0	)
	(	7.877656679	-0.412850492	0	)
	(	7.841158761	-0.410937718	0	)
	(	7.804913905	-0.409038205	0	)
	(	7.768919776	-0.407151833	0	)
	(	7.733174066	-0.40527848	0	)
	(	7.697674495	-0.403418026	0	)
	(	7.662418809	-0.401570354	0	)
	(	7.627404777	-0.399735346	0	)
	(	7.592630198	-0.397912888	0	)
	(	7.558092892	-0.396102864	0	)
	(	7.523790706	-0.394305163	0	)
	(	7.489721511	-0.392519672	0	)
	);

     }

   finalWire
    {
     	type            movingWallVelocity;
        value           uniform (10 0 0);
     }



    back
    {
        type            wedge;
    }

    front
    {
        type            wedge;
    }
}

// ************************************************************************* //
