test_examples/wireDrawing_OpenFoam_abaqus6/setup_openfoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
	preconditioner	DIC;
        tolerance       1e-6;
        relTol          0.05; 
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorr
    {
        $p
        tolerance       0.02;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    cellDisplacement
    {
        solver          GAMG;
        smoother	GaussSeidel;
        tolerance       1e-08;
        relTol          0.000001;
    }
}

PIMPLE
{
    correctPhi          yes;
    nOuterCorrectors    7;
    nCorrectors         10;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    equations
    {
        "U.*"           1;
    }
}


// ************************************************************************* //
